"use server";

import { HfInference } from "@huggingface/inference";

const roleToContext = {
  webasics: `
  הסדנה מיועדת לתלמידי החטיבה והתיכון ללא רקע (גילאי 13-16 בעיקר) אשר מעוניינים ללמוד ולחקור את התחומים. בסוף הסדנה כל חניך ידע להקים אתר ולעלות אותו לאינטרנט מאפס, אתר אשר יכיל בתוכו שימוש בכלי Ai שונים.
סדנה בת 13 מפגשים אשר יועברו פעם בשבוע באופן פרונטלי באזור מרכז אורך כל מפגש הוא שעה וחצי, לפרטים נוספים מוזמנים ליצור קשר*. 
הסדנה היא תוכנית ייחודית וחדשנית המעברת על ידי webasics.

מה נלמד?
להשתמש בסביבת העבודה ועזרים נוספים
שימוש והבנה של כלי ה-Ai החדשים בשוק
תכנות בסיסי בשפת JavaScript
בניית אתרים 
עיצוב אתרים והבנת מבנה האתר
העלאת אתרים בחינם לאינטרנט
שימוש בסיסי בgithub, לשמירת הקוד ולתחזוקה

הסדנה של webasics תתחיל ב-1 ביוני
  `,
  engineer: `
  מהנדס הוא אדם העוסק בהנדסה. תפקיד המהנדס הוא ליישם את ההתקדמות המדעית והטכנולוגית שהושגה על ידי אנשי מדע ומחקר. המהנדס בדרך כלל מאפיין את הבעיה שלפתרונה הוא נצרך, כולל הצרכים והמגבלות, ועל סמך הידע והניסיון שלו נותן פתרון תכנוני סביר, אך לאו דווקא אופטימלי, לבעיה זו. התואר מהנדס הוא תואר אקדמי.

בשונה מהחוקר המדעי, המהנדס מתבסס לא רק על ידע מתמטי ומדעי, אלא גם על ידע אמפירי בתחומו, על כללי אצבע ועל פרקטיקות מקובלות, כדי למצוא פתרון שהוא נכון וגם כלכלי. מלבד נכונות הפתרון לבעיה, המהנדס עשוי להתחשב במאפיינים שונים של הפתרון, כגון עלויות ייצור ואחזקה. כך למשל, אם הכימאי ינסה למצוא נוסחה לחומר שייתן תכונות מסוימות, ויסנתז אותו במיליגרמים במעבדה, מהנדס כימיה עשוי לנסות למצוא דרך לייצר כמות גדולה של אותו החומר בצורה כלכלית במפעל.


  `,
  teacher: `
  מידת האחריות של המורה לחינוך הדור הצעיר משתנה מחברה לחברה ומתקופה לתקופה.[1]

אופי התייחסותו של מורה לכל תלמיד, וטכניקת הלימוד שהוא מיישם על תלמידיו השונים, הם משתנים לא קבועים, המושפעים מאישיות המורה, השקפת עולמו החינוכית, סביבת הלימוד, הרקע החינוכי והחברתי של התלמידים, מטרות הלמידה של המורה והתלמיד, ודרישות המערכת החינוכית שבה המורה נמצא.

המורה הוא הגורם המרכזי אשר מחולל שינויים רצויים אצל הלומדים. כמו כן, למורה יש חלק פעיל בתהליך ההתפתחות החברתית והחיברות של התלמיד. בעוד שהקשרים הבין אישיים הראשונים מתחילים בגיל הינקות במסגרת המשפחה,[2] קשרים משמעותיים נוספים של הילד עם אנשים מבוגרים יכולים להיווצר מול דמויות חינוכיות כמו הגננת והמורה.[3] על כן ישנה חשיבות מכרעת לאישיותו ולהתנהגותו בכיתה.

על מנת לשמור על מסגרת השיעור, על המורה להקפיד על הצבת גבולות ברורה בכיתת הלימוד. כמו כן, על המורה לטפח ולעודד את המוטיבציה ללמידה בקרב תלמידיו.[4] כדי להטיב את התהליך המידעני, ולהניע את תלמידיו לשאול שאלות שמעניינות אותם ולחפש תשובות לסוגיות הנגזרות ממצבים שמשמעותיים עבורם, על המורה לוותר מדי פעם על תפקידו כמשנע מידע ולמלא תפקיד של מעורר סקרנות ומספק אתגרים.[5]

הוראה
 ערך מורחב – הוראה

ההוראה היא עיסוקו המרכזי של המורה, ציור משנת 1845.
ההוראה היא עיסוקו המרכזי של המורה. הוראה היא אחת מתהליכי הלמידה בחינוך. מטרתה היא להקנות ידע ולהכשיר את התלמיד ללמוד בכוחות עצמו באמצעות פיתוח יכולות אורייניות, אסטרטגיית למידה ומיומנויות חשיבה. המורה יכול ללמד חומר עיוני או כישורים טכניים או אומנותיים במגוון של נושאים.
  `,
};

const MODEL_CHECKPOINT = "tdklab/hebert-finetuned-hebrew-squad";

export async function sendQuestion(formData) {
  const question = formData.get("question");
  const role = formData.get("role");
  const context = role in roleToContext ? roleToContext[role] : "";
  console.log(formData, question, role);

  if (!context || !question) {
    return { answer: "אנא שאל.י שאלה", score: 1 };
  }

  const inference = new HfInference(process.env.HF_TOKEN);

  try {
    const res = await inference.questionAnswering({
      model: MODEL_CHECKPOINT,
      inputs: {
        question,
        context,
      },
    });

    console.log("ANSWER", res.answer, res);

    return {
      answer: res.answer,
      score: res.score,
    };
  } catch (error) {
    console.log("ERROR", error);
    return { error };
  }
}
